# Salary Prediction

All the observations are below the codes or metioned as comment

In [5]:
# necessary imports

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import pickle
%matplotlib inline

In [6]:
# salaries file uploaded here
df= pd.read_csv('https://raw.githubusercontent.com/dsrscientist/dataset3/main/Salaries.csv')
df

         rank discipline  yrs.since.phd  yrs.service   sex  salary
0        Prof          B             19           18  Male  139750
1        Prof          B             20           16  Male  173200
2    AsstProf          B              4            3  Male   79750
3        Prof          B             45           39  Male  115000
4        Prof          B             40           41  Male  141500
..        ...        ...            ...          ...   ...     ...
392      Prof          A             33           30  Male  103106
393      Prof          A             31           19  Male  150564
394      Prof          A             42           25  Male  101738
395      Prof          A             25           15  Male   95329
396  AsstProf          A              8            4  Male   81035

[397 rows x 6 columns]

In [7]:
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
0      Prof          B             19           18  Male  139750
1      Prof          B             20           16  Male  173200
2  AsstProf          B              4            3  Male   79750
3      Prof          B             45           39  Male  115000
4      Prof          B             40           41  Male  141500

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   rank           397 non-null    object
 1   discipline     397 non-null    object
 2   yrs.since.phd  397 non-null    int64
 3   yrs.service    397 non-null    int64
 4   sex            397 non-null    object
 5   salary         397 non-null    int64
dtypes: int64(3), object(3)
memory usage: 18.7+ KB

In [9]:
df.describe()

       yrs.since.phd  yrs.service         salary
count     397.000000   397.000000     397.000000
mean       22.314861    17.614610  113706.458438
std        12.887003    13.006024   30289.038695
min         1.000000     0.000000   57800.000000
25%        12.000000     7.000000   91000.000000
50%        21.000000    16.000000  107300.000000
75%        32.000000    27.000000  134185.000000
max        56.000000    60.000000  231545.000000

In [11]:
df_new= pd.DataFrame({'yrs.since.phd':[25],'yrs.service':[20]})
df_new

   yrs.since.phd  yrs.service
0             25           20

a new data set has been created here to predict if the phd yrs will be 25 and service yr will be 20 the what should be the new salary.
so df_new is created here

In [12]:
feature_cols=['yrs.since.phd','yrs.service']
x=df[feature_cols]
y=df.salary

only two columns have numeric data in it through which salaries can be predicted. so calling two cpolmns and assigning x and y path

In [15]:
#importing Linear regression here
from sklearn.linear_model import LinearRegression

In [16]:
lm=LinearRegression()
lm.fit(x,y)
lm.predict(df_new)

array([116402.37922906])

Here is the new salary prediction of the person who have 25 years of phd and 2o years of overall exp.
=> we can change the different exp and years of holding phd to predict different salaries